app/controllers/alarm_controller.rb

  def index
    @alarms = Alarm.order('created_at DESC')
---
SELECT "alarms".* FROM "alarms" ORDER BY "alarms"."created_at" ASC

  def create
    @alarm = Alarm.new(alarm_params)

    if @alarm.save
---
INSERT INTO "alarms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "34728"], ["created_at", "2018-10-20 02:31:29.624659"], ["updated_at", "2018-10-20 02:31:29.624659"]]

  def upvote
    @session = VoterSession.find_by(session_id: request.session_options[:id])
    if @session == nil
      @session = VoterSession.create(session_id: request.session_options[:id])
    end
    @alarm = Alarm.find(params[:id])
---
SELECT  "voter_sessions".* FROM "voter_sessions" WHERE "voter_sessions"."session_id" = ? LIMIT ?  [["session_id", "4c550233f9543f90d5551a4ab8723abb"], ["LIMIT", 1]]
INSERT INTO "votes" ("votable_type", "votable_id", "voter_type", "voter_id", "vote_flag", "vote_weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "voter_sessions" ("created_at", "updated_at", "session_id") VALUES (?, ?, ?)  [["created_at", "2018-10-20 04:28:21.647350"], ["updated_at", "2018-10-20 04:28:21.647350"], ["session_id", "4c550233f9543f90d5551a4ab8723abb"]]
SELECT  "alarms".* FROM "alarms" WHERE "alarms"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]